Repository: toby05169/Translatar
Catalog: Translatar/Resources/*.lproj/Localizable.strings
Languages: ja, my, th, vi, zh

# tab.translate
source: Translate
ja: 翻訳
my: ဘာသာပြန်
th: แปล
vi: Dịch
zh: 翻译

# tab.history
source: History
ja: 履歴
my: မှတ်တမ်း
th: ประวัติ
vi: Lịch sử
zh: 记录

# tab.settings
source: Settings
ja: 設定
my: ဆက်တင်
th: ตั้งค่า
vi: Cài đặt
zh: 设置

# mode.conversation
source: Conversation
ja: 会話モード
my: စကားပြောမုဒ်
th: โหมดสนทนา
vi: Chế độ hội thoại
zh: 对话模式

# mode.immersive
source: Immersive
ja: Interpreter
my: နားထောင်မုဒ်
vi: Chế độ lắng nghe
zh: 沉浸模式

# mode.conversation.desc
source: Face-to-face chat with auto turn detection
ja: 対面での会話に最適、自動ターン検出
my: မျက်နှာချင်းဆိုင် စကားပြောရန်၊ အလိုအလျောက် အလှည့်ကျ ရှာဖွေခြင်း
th: สนทนาแบบตัวต่อตัว ตรวจจับการสลับพูดอัตโนมัติ
vi: Trò chuyện trực tiếp, tự động nhận diện lượt nói
zh: 适合面对面交流，自动识别对话轮次

# mode.immersive.desc
source: Continuous listening for broadcasts and ambient speech
ja: Real-time simultaneous interpretation
my: ပတ်ဝန်းကျင် အသံကို ဆက်တိုက် နားထောင်ပြီး ဘာသာပြန်ခြင်း
vi: Lắng nghe liên tục, dịch thông báo và âm thanh xung quanh
zh: 持续监听环境音，实时翻译广播和对话

# status.disconnected
source: Disconnected
ja: 未接続
my: ချိတ်ဆက်မထားပါ
th: ไม่ได้เชื่อมต่อ
vi: Chưa kết nối
zh: 未连接

# status.connecting
source: Connecting...
ja: 接続中...
my: ချိတ်ဆက်နေသည်...
th: กำลังเชื่อมต่อ...
vi: Đang kết nối...
zh: 正在连接...

# status.connected
source: Ready, waiting for speech
ja: 準備完了、音声入力を待機中
my: အဆင်သင့်ဖြစ်ပြီ၊ အသံထည့်ရန် စောင့်နေသည်
th: พร้อมแล้ว รอเสียงพูด
vi: Sẵn sàng, chờ giọng nói
zh: 已就绪，等待语音输入

# status.translating
source: Translating...
ja: 翻訳中...
my: ဘာသာပြန်နေသည်...
th: กำลังแปล...
vi: Đang dịch...
zh: 正在翻译...

# status.error
source: Error: %@
ja: エラー：%@
my: အမှား: %@
th: ข้อผิดพลาด: %@
vi: Lỗi: %@
zh: 错误：%@

# lang.source
source: Language A
ja: 相手の言語
my: သူတို့ပြောသည်
th: เขาพูด
vi: Họ nói
zh: 对方说

# lang.target
source: Language B
ja: 翻訳先
my: ဘာသာပြန်ရန်
th: แปลเป็น
vi: Dịch sang
zh: 翻译成

# status.online
source: Online
ja: オンライン
my: အွန်လိုင်း
th: ออนไลน์
vi: Trực tuyến
zh: 在线

# status.offline
source: Offline
ja: オフライン
my: အော့ဖ်လိုင်း
th: ออฟไลน์
vi: Ngoại tuyến
zh: 离线

# status.noise.on
source: Denoise On
ja: ノイズ除去 ON
my: ဆူညံသံလျှော့ ဖွင့်
th: ลดเสียงรบกวน เปิด
vi: Khử ồn Bật
zh: 降噪开

# status.noise.off
source: Denoise Off
ja: ノイズ除去 OFF
my: ဆူညံသံလျှော့ ပိတ်
th: ลดเสียงรบกวน ปิด
vi: Khử ồn Tắt
zh: 降噪关

# status.listening
source: Listening
ja: 環境リスニング
my: ပတ်ဝန်းကျင် နားထောင်ခြင်း
th: ฟังสิ่งแวดล้อม
vi: Nghe môi trường
zh: 环境监听

# status.chatting
source: Chat Mode
ja: 会話翻訳
my: စကားပြော ဘာသာပြန်
th: โหมดสนทนา
vi: Dịch hội thoại
zh: 对话翻译

# status.monitoring
source: Listening...
ja: リスニング中...
my: နားထောင်နေသည်...
th: กำลังฟัง...
vi: Đang lắng nghe...
zh: 持续监听中

# display.original
source: Original
ja: 原文
my: မူရင်း
th: ต้นฉบับ
vi: Gốc
zh: 原文

# display.translated
source: Translation
ja: 翻訳
my: ဘာသာပြန်
th: คำแปล
vi: Bản dịch
zh: 翻译

# button.stop
source: Stop
ja: 停止
my: ရပ်
th: หยุด
vi: Dừng
zh: 停止

# button.start.listen
source: Listen
ja: リスニング開始
my: နားထောင်ရန်
th: เริ่มฟัง
vi: Bắt đầu nghe
zh: 开始监听

# button.start.translate
source: Translate
ja: 翻訳開始
my: ဘာသာပြန်ရန်
th: เริ่มแปล
vi: Bắt đầu dịch
zh: 开始翻译

# history.recent
source: Recent
ja: 最近の翻訳
my: မကြာသေးမီ
th: แปลล่าสุด
vi: Dịch gần đây
zh: 最近翻译

# history.title
source: History
ja: 翻訳履歴
my: ဘာသာပြန် မှတ်တမ်း
th: ประวัติการแปล
vi: Lịch sử dịch
zh: 翻译记录

# history.empty.immersive
source: Translations will appear here after you start listening
ja: リスニング開始後、翻訳がここに表示されます
my: နားထောင်ပြီးနောက် ဘာသာပြန်ချက်များ ဤနေရာတွင် ပေါ်လာမည်
vi: Bản dịch sẽ hiển thị ở đây sau khi bắt đầu nghe
zh: 开始监听后，环境音翻译将显示在这里

# history.empty.conversation
source: Conversation records will appear here after you start
ja: 翻訳開始後、会話記録がここに表示されます
my: ဘာသာပြန်ပြီးနောက် စကားပြောမှတ်တမ်း ဤနေရာတွင် ပေါ်လာမည်
th: บันทึกสนทนาจะแสดงที่นี่หลังจากเริ่มแปล
vi: Hội thoại sẽ hiển thị ở đây sau khi bắt đầu dịch
zh: 开始翻译后，对话记录将显示在这里

# history.auto.save
source: Conversations will be auto-saved here
ja: 会話記録は自動的にここに保存されます
my: စကားပြောမှတ်တမ်းများ အလိုအလျောက် သိမ်းဆည်းပါမည်
th: บันทึกสนทนาจะถูกบันทึกอัตโนมัติที่นี่
vi: Hội thoại sẽ được tự động lưu ở đây
zh: 开始翻译后，对话记录将自动保存在这里

# quota.title
source: Daily Free Quota
ja: 本日の無料枠
my: ယနေ့ အခမဲ့ ပမာဏ
th: โควต้าฟรีวันนี้
vi: Hạn mức miễn phí hôm nay
zh: 今日免费额度

# quota.remaining
source: %@ left
ja: 残り %@
my: %@ ကျန်ရှိ
th: เหลือ %@
vi: Còn %@
zh: 剩余 %@

# quota.upgrade
source: Upgrade PRO
ja: PRO にアップグレード
my: PRO သို့ အဆင့်မြှင့်
th: อัปเกรด PRO
vi: Nâng cấp PRO
zh: 升级 PRO

# common.offline.badge
source: Offline
ja: オフライン
my: အော့ဖ်လိုင်း
th: ออฟไลน์
vi: Ngoại tuyến
zh: 离线

# common.alert.title
source: Notice
ja: お知らせ
my: အသိပေးချက်
th: แจ้งเตือน
vi: Thông báo
zh: 提示

# common.alert.ok
source: OK
my: အိုကေ
th: ตกลง
vi: Đồng ý
zh: 确定

# common.alert.unknown.error
source: An unknown error occurred
ja: 不明なエラーが発生しました
my: မသိသော အမှားတစ်ခု ဖြစ်ပွားခဲ့သည်
th: เกิดข้อผิดพลาดที่ไม่ทราบสาเหตุ
vi: Đã xảy ra lỗi không xác định
zh: 发生未知错误

# settings.title
source: Settings
ja: 設定
my: ဆက်တင်
th: ตั้งค่า
vi: Cài đặt
zh: 设置

# settings.translation.mode
source: Translation Mode
ja: 翻訳モード
my: ဘာသာပြန် မုဒ်
th: โหมดแปล
vi: Chế độ dịch
zh: 翻译模式

# onboarding.next
source: Next
ja: 次へ
my: ရှေ့ဆက်
th: ถัดไป
vi: Tiếp theo
zh: 下一步

# onboarding.start
source: Get Started
ja: 始めましょう
my: စတင်ရန်
th: เริ่มใช้งาน
vi: Bắt đầu
zh: 开始体验

# onboarding.subtitle
source: Language is no longer a barrier
ja: 言葉の壁はもうありません
my: ဘာသာစကားသည် အတားအဆီး မဟုတ်တော့ပါ
th: ภาษาไม่ใช่อุปสรรคอีกต่อไป
vi: Ngôn ngữ không còn là rào cản
zh: 语言不再是障碍

# paywall.immersive
source: Immersive Mode (Airport Broadcasts)
ja: Simultaneous Interpretation
my: နားထောင်မုဒ် (လေဆိပ်ကြေညာချက် ဘာသာပြန်)
vi: Chế độ lắng nghe (Dịch thông báo sân bay)
zh: 沉浸模式（机场广播翻译）

# paywall.conversation
source: Conversation Mode
ja: 会話モード
my: စကားပြောမုဒ်
th: โหมดสนทนา
vi: Chế độ hội thoại
zh: 对话模式

# paywall.start.trial
source: Start 7-Day Free Trial
ja: 7日間無料トライアルを開始
my: ၇ ရက် အခမဲ့ စမ်းသုံးရန်
th: เริ่มทดลองใช้ฟรี 7 วัน
vi: Dùng thử miễn phí 7 ngày
zh: 开始7天免费试用

# subscription.free.features
source: 5 min daily quota,Conversation mode,10 languages,Bilingual subtitles
ja: 毎日5分の翻訳枠,会話モード,10言語,バイリンガル字幕
my: နေ့စဉ် ၅ မိနစ် ဘာသာပြန်,စကားပြောမုဒ်,ဘာသာ ၁၀ ခု,နှစ်ဘာသာ စာတန်း
th: โควต้าแปลวันละ 5 นาที,โหมดสนทนา,10 ภาษา,คำบรรยายสองภาษา
vi: 5 phút dịch miễn phí/ngày,Chế độ hội thoại,10 ngôn ngữ,Phụ đề song ngữ
zh: 每天5分钟翻译额度,对话模式,10种语言,双语字幕

# subscription.pro.features
source: Unlimited translation,Conversation + Immersive,AI noise reduction,Offline translation,Export history,Priority support
ja: 無制限翻訳,会話 + 没入モード,AIノイズ除去,オフライン翻訳,履歴エクスポート,優先サポート
my: အကန့်အသတ်မဲ့ ဘာသာပြန်,စကားပြော + နားထောင်,AI ဆူညံသံလျှော့,အော့ဖ်လိုင်း ဘာသာပြန်,မှတ်တမ်း တင်ပို့,ဦးစားပေး ပံ့ပိုး
th: แปลไม่จำกัด,สนทนา + ดื่มด่ำ,AI ลดเสียงรบกวน,แปลออฟไลน์,ส่งออกประวัติ,สนับสนุนลำดับแรก
vi: Dịch không giới hạn,Hội thoại + Lắng nghe,AI khử ồn,Dịch ngoại tuyến,Xuất lịch sử,Hỗ trợ ưu tiên
zh: 无限翻译时长,对话模式 + 沉浸模式,AI智能降噪,离线翻译,翻译历史导出,优先客服支持

# group.eastAsia
source: East Asian
ja: 東アジア言語
my: အရှေ့အာရှ
th: ภาษาเอเชียตะวันออก
vi: Đông Á
zh: 东亚语言

# group.southeastAsia
source: Southeast Asian
ja: 東南アジア言語
my: အရှေ့တောင်အာရှ
th: ภาษาเอเชียตะวันออกเฉียงใต้
vi: Đông Nam Á
zh: 东南亚语言

# group.southAsia
source: South Asian
ja: 南アジア言語
my: တောင်အာရှ
th: ภาษาเอเชียใต้
vi: Nam Á
zh: 南亚语言

# group.europeAmericas
source: European & Americas
ja: 欧米言語
my: ဥရောပနှင့် အမေရိက
th: ภาษายุโรปและอเมริกา
vi: Châu Âu & Châu Mỹ
zh: 欧美语言

# group.middleEastAfrica
source: Middle East & Africa
ja: 中東・アフリカ言語
my: အရှေ့အလယ်ပိုင်းနှင့် အာဖရိက
th: ภาษาตะวันออกกลางและแอฟริกา
vi: Trung Đông & Châu Phi
zh: 中东/非洲语言

# lang.name.cantonese
source: Cantonese
ja: 広東語
my: ကွမ်တုံ
th: ภาษากวางตุ้ง
vi: Tiếng Quảng Đông
zh: 粤语

# lang.name.hokkien
source: Hokkien
ja: 閩南語
my: ဟုတ်ကျန်
th: ภาษาฮกเกี้ยน
vi: Tiếng Mân Nam
zh: 闽南语

# settings.expiry
source: Expires
ja: 有効期限
my: သက်တမ်းကုန်ဆုံးချိန်
th: หมดอายุ
vi: Hết hạn
zh: 到期时间

# settings.freeLimit
source: 5 min free translation daily
ja: 毎日5分間無料翻訳
my: နေ့စဉ် ၅ မိနစ် အခမဲ့ ဘာသာပြန်
th: แปลฟรี 5 นาทีต่อวัน
vi: Dịch miễn phí 5 phút mỗi ngày
zh: 每天5分钟免费翻译

# settings.allUnlocked
source: All features unlocked
ja: 全機能がアンロック済み
my: အင်္ဂါရပ်အားလုံး ဖွင့်ပြီး
th: ปลดล็อกทุกฟีเจอร์แล้ว
vi: Đã mở khóa tất cả tính năng
zh: 全部功能已解锁

# settings.upgrade
source: Upgrade
ja: アップグレード
my: အဆင့်မြှင့်
th: อัปเกรด
vi: Nâng cấp
zh: 升级

# settings.restore
source: Restore Purchases
ja: 購入を復元
my: ဝယ်ယူမှုများ ပြန်လည်ရယူ
th: กู้คืนการซื้อ
vi: Khôi phục mua hàng
zh: 恢复购买

# settings.manageSubscription
source: Manage Subscription
ja: サブスクリプション管理
my: စာရင်းသွင်းမှု စီမံ
th: จัดการการสมัครสมาชิก
vi: Quản lý đăng ký
zh: 管理订阅

# settings.section.subscription
source: Subscription
ja: サブスクリプション
my: စာရင်းသွင်းမှု
th: การสมัครสมาชิก
vi: Đăng ký
zh: 订阅

# settings.section.translationMode
source: Translation Mode
ja: 翻訳モード
my: ဘာသာပြန်မုဒ်
th: โหมดแปล
vi: Chế độ dịch
zh: 翻译模式

# settings.section.audio
source: Audio Settings
ja: オーディオ設定
my: အသံဆက်တင်
th: การตั้งค่าเสียง
vi: Cài đặt âm thanh
zh: 音频设置

# settings.section.offline
source: Offline Translation
ja: オフライン翻訳
my: အော့ဖ်လိုင်း ဘာသာပြန်
th: แปลออฟไลน์
vi: Dịch ngoại tuyến
zh: 离线翻译

# settings.section.about
source: About
ja: アプリについて
my: အကြောင်း
th: เกี่ยวกับ
vi: Giới thiệu
zh: 关于

# settings.section.account
source: Account
ja: アカウント
my: အကောင့်
th: บัญชี
vi: Tài khoản
zh: 账号配置

# settings.apiKey.title
source: OpenAI API Key
ja: API
my: OpenAI API သော့
th: API
vi: API
zh: OpenAI API 密钥

# settings.save
source: Save
ja: 保存
my: သိမ်းဆည်း
th: บันทึก
vi: Lưu
zh: 保存

# settings.apiKey.note
source: API key is stored locally on your device only.
ja: APIキーはデバイスにのみ保存されます。
my: API သော့ကို သင့်စက်တွင်သာ သိမ်းဆည်းထားသည်။
th: คีย์ API เก็บไว้ในอุปกรณ์ของคุณเท่านั้น
vi: Khóa API chỉ được lưu trên thiết bị của bạn.
zh: API密钥仅保存在本地设备上，不会上传到任何服务器。

# settings.noiseSuppression
source: AI Noise Suppression
ja: AIノイズ抑制
my: AI ဆူညံသံ လျှော့ချ
th: ตัดเสียงรบกวน AI
vi: Khử tiếng ồn AI
zh: AI降噪

# settings.noiseSuppression.desc
source: Apple Voice Processing technology
ja: Apple Voice Processing技術
my: Apple Voice Processing နည်းပညာ
th: เทคโนโลยี Apple Voice Processing
vi: Công nghệ Apple Voice Processing
zh: Apple Voice Processing 降噪技术

# settings.noiseSuppression.footer
source: Recommended in noisy environments. Uses Apple native Voice Processing.
ja: 騒がしい環境ではオンにすることをお勧めします。
my: ဆူညံသော ပတ်ဝန်းကျင်တွင် ဖွင့်ရန် အကြံပြုသည်။
th: แนะนำให้เปิดในสภาพแวดล้อมที่มีเสียงดัง
vi: Nên bật trong môi trường ồn ào.
zh: 降噪功能使用Apple原生Voice Processing技术，在嘈杂环境中建议开启。

# settings.autoOffline
source: Auto Offline Switch
ja: 自動オフライン切替
my: အလိုအလျောက် အော့ဖ်လိုင်း ပြောင်း
th: สลับออฟไลน์อัตโนมัติ
vi: Tự động chuyển ngoại tuyến
zh: 自动离线切换

# settings.autoOffline.desc
source: Auto switch to offline when disconnected
ja: 切断時に自動でオフラインに切替
my: ချိတ်ဆက်မှု ပြတ်သွားသောအခါ အလိုအလျောက် ပြောင်း
th: สลับเป็นออฟไลน์เมื่อขาดการเชื่อมต่อ
vi: Tự động chuyển khi mất kết nối
zh: 网络断开时自动切换到离线翻译

# settings.offlinePack
source: Offline Language Packs
ja: オフライン言語パック
my: အော့ဖ်လိုင်း ဘာသာစကား
th: แพ็คภาษาออฟไลน์
vi: Gói ngôn ngữ ngoại tuyến
zh: 离线语言包

# settings.version
source: Version
ja: バージョン
my: ဗားရှင်း
th: เวอร์ชัน
vi: Phiên bản
zh: 版本

# settings.onlineEngine
source: Online Engine
ja: オンラインエンジン
my: အွန်လိုင်း အင်ဂျင်
th: เอนจินออนไลน์
vi: Công cụ trực tuyến
zh: 在线翻译引擎

# settings.offlineEngine
source: Offline Engine
ja: オフラインエンジン
my: အော့ဖ်လိုင်း အင်ဂျင်
th: เอนจินออฟไลน์
vi: Công cụ ngoại tuyến
zh: 离线翻译引擎

# settings.privacy
source: Privacy Policy
ja: プライバシーポリシー
my: ကိုယ်ရေးကိုယ်တာ မူဝါဒ
th: นโยบายความเป็นส่วนตัว
vi: Chính sách bảo mật
zh: 隐私政策

# settings.terms
source: Terms of Service
ja: 利用規約
my: အသုံးပြုမှု စည်းကမ်း
th: ข้อกำหนดการใช้งาน
vi: Điều khoản sử dụng
zh: 使用条款

# settings.feedback
source: Feedback
ja: フィードバック
my: အကြံပြုချက်
th: ข้อเสนอแนะ
vi: Phản hồi
zh: 意见反馈

# history.search
source: Search translations
ja: 翻訳を検索
my: ဘာသာပြန်ရှာဖွေ
th: ค้นหาการแปล
vi: Tìm kiếm bản dịch
zh: 搜索翻译记录

# history.empty.title
source: No translations yet
ja: 翻訳履歴がありません
my: ဘာသာပြန်မှတ်တမ်း မရှိသေးပါ
th: ยังไม่มีประวัติการแปล
vi: Chưa có bản dịch nào
zh: 暂无翻译记录

# history.empty.subtitle
source: Translations will be saved here automatically
ja: 翻訳は自動的にここに保存されます
my: ဘာသာပြန်များကို ဤနေရာတွင် အလိုအလျောက် သိမ်းဆည်းပါမည်
th: การแปลจะถูกบันทึกที่นี่โดยอัตโนมัติ
vi: Bản dịch sẽ được lưu tự động tại đây
zh: 开始翻译后，对话记录将自动保存在这里

# history.copy
source: Copy Translation
ja: 翻訳をコピー
my: ဘာသာပြန်ကူးယူ
th: คัดลอกคำแปล
vi: Sao chép bản dịch
zh: 复制翻译

# history.share
source: Share
ja: 共有
my: မျှဝေ
th: แชร์
vi: Chia sẻ
zh: 分享

# history.export.header
source: Translatar History
ja: Translatar 翻訳履歴
my: Translatar ဘာသာပြန်မှတ်တမ်း
th: ประวัติการแปล Translatar
vi: Lịch sử dịch Translatar
zh: Translatar 翻译记录

# history.export.time
source: Export time
ja: エクスポート時刻
my: ထုတ်ယူချိန်
th: เวลาส่งออก
vi: Thời gian xuất
zh: 导出时间

# history.original
source: Original
ja: 原文
my: မူရင်း
th: ต้นฉบับ
vi: Bản gốc
zh: 原文

# history.translated
source: Translation
ja: 翻訳
my: ဘာသာပြန်
th: คำแปล
vi: Bản dịch
zh: 翻译

# common.close
source: Close
ja: 閉じる
my: ပိတ်
th: ปิด
vi: Đóng
zh: 关闭

# settings.offline.speech.hint
source: • Speech: Settings → General → Keyboard → Dictation Languages
ja: • 音声認識: 設定 → 一般 → キーボード → 音声入力言語
my: • အသံအသိအမှတ်ပြု: ဆက်တင် → အထွေထွေ → ကီးဘုတ် → အမိန့်ပေးစာရိုက်ဘာသာစကား
th: • การรู้จำเสียง: ตั้งค่า → ทั่วไป → คีย์บอร์ด → ภาษาเขียนตามคำบอก
vi: • Nhận dạng giọng nói: Cài đặt → Cài đặt chung → Bàn phím → Ngôn ngữ đọc chính tả
zh: • 语音识别：设置 → 通用 → 键盘 → 听写语言

# settings.offline.translate.hint
source: • Translation: Settings → General → Translation → Download Languages (iOS 18+)
ja: • 翻訳エンジン: 設定 → 一般 → 翻訳 → 言語をダウンロード (iOS 18+)
my: • ဘာသာပြန်အင်ဂျင်: ဆက်တင် → အထွေထွေ → ဘာသာပြန် → ဘာသာစကားဒေါင်းလုဒ် (iOS 18+)
th: • เอนจินแปล: ตั้งค่า → ทั่วไป → แปลภาษา → ดาวน์โหลดภาษา (iOS 18+)
vi: • Công cụ dịch: Cài đặt → Cài đặt chung → Dịch → Tải ngôn ngữ (iOS 18+)
zh: • 翻译引擎：设置 → 通用 → 翻译 → 下载语言（iOS 18+）

# onboarding.title1
source: Language Is No Longer a Barrier
ja: 言語はもう障壁ではない
th: ภาษาไม่ใช่อุปสรรคอีกต่อไป
vi: Ngôn ngữ không còn là rào cản
zh: 语言不再是障碍

# onboarding.desc1
source: Connect your AirPods, choose a language, and tap. From now on, foreign languages flow into your ears as naturally as your mother tongue.
ja: AirPodsを接続し、言語を選んでタップするだけ。外国語が母語のように自然に耳に流れ込みます。
th: เชื่อมต่อ AirPods เลือกภาษา แตะเบาๆ ตั้งแต่นี้ ภาษาต่างประเทศจะไหลเข้าหูคุณอย่างเป็นธรรมชาติ
vi: Kết nối AirPods, chọn ngôn ngữ, chạm nhẹ. Từ nay, ngoại ngữ sẽ tự nhiên chảy vào tai bạn.
zh: 连接AirPods，选择语言，轻轻一点。从此，外语就像母语一样自然流入你的耳朵。

# onboarding.title2
source: AI Real-time Translation
ja: AIリアルタイム翻訳
th: แปลภาษา AI แบบเรียลไทม์
vi: Dịch AI thời gian thực
zh: AI实时翻译

# onboarding.subtitle2
source: Millisecond response, naturally fluent
ja: ミリ秒の応答、自然で流暢
th: ตอบสนองระดับมิลลิวินาที ลื่นไหลเป็นธรรมชาติ
vi: Phản hồi mili giây, tự nhiên trôi chảy
zh: 毫秒级响应，自然流畅

# onboarding.desc2
source: Powered by the most advanced AI voice models. Not word-by-word translation, but natural expression after understanding context. Supports 30+ languages.
ja: 最先端のAI音声モデルを搭載。単語ごとの翻訳ではなく、文脈を理解した自然な表現。30以上の言語に対応。
th: ขับเคลื่อนด้วยโมเดลเสียง AI ที่ทันสมัยที่สุด ไม่ใช่แปลทีละคำ แต่เป็นการแสดงออกที่เป็นธรรมชาติ รองรับ 30+ ภาษา
vi: Sử dụng mô hình giọng nói AI tiên tiến nhất. Không dịch từng từ mà hiểu ngữ cảnh. Hỗ trợ 30+ ngôn ngữ.
zh: 基于最先进的AI语音模型，不是逐字翻译，而是理解语境后的自然表达。支持30+种语言互译。

# onboarding.title3
source: Immersive Mode
ja: イマーシブモード
th: โหมดดื่มด่ำ
vi: Chế độ đắm chìm
zh: 沉浸模式

# onboarding.subtitle3
source: Never miss an airport announcement
ja: 空港のアナウンスを見逃さない
th: ไม่พลาดประกาศสนามบินอีกต่อไป
vi: Không bỏ lỡ thông báo sân bay
zh: 机场广播再也不会错过

# onboarding.desc3
source: At airports, stations, and more — turn on Immersive Mode to auto-translate all surrounding speech. Gate changes, flight delays — know instantly.
ja: 空港や駅でイマーシブモードをオンにすると、周囲の音声を自動翻訳。ゲート変更やフライト遅延を即座に把握。
th: ที่สนามบิน สถานี เปิดโหมดดื่มด่ำเพื่อแปลเสียงรอบข้างโดยอัตโนมัติ เปลี่ยนเกต เที่ยวบินล่าช้า รู้ทันที
vi: Tại sân bay, nhà ga — bật Chế độ đắm chìm để tự động dịch mọi âm thanh xung quanh.
zh: 在机场、车站等场景，开启沉浸模式，自动翻译周围所有语音。登机口变更、航班延误，第一时间知道。

# onboarding.title4
source: Smart Noise Reduction · Works Offline
ja: スマートノイズリダクション・オフライン対応
th: ลดเสียงรบกวนอัจฉริยะ · ใช้ออฟไลน์ได้
vi: Giảm tiếng ồn thông minh · Hoạt động ngoại tuyến
zh: 智能降噪 · 离线可用

# onboarding.subtitle4
source: Accurate translation even in noisy environments
ja: 騒がしい環境でも正確に翻訳
th: แปลแม่นยำแม้ในสภาพแวดล้อมที่มีเสียงดัง
vi: Dịch chính xác ngay cả trong môi trường ồn ào
zh: 嘈杂环境也能精准翻译

# onboarding.desc4
source: AI noise reduction filters ambient noise and captures voices precisely. Even without internet, offline translation has you covered.
ja: AIノイズリダクション技術で環境ノイズをフィルタリングし、人の声を正確にキャプチャ。インターネットがなくてもオフライン翻訳が利用可能。
th: เทคโนโลยีลดเสียงรบกวน AI กรองเสียงรบกวนและจับเสียงพูดได้อย่างแม่นยำ แม้ไม่มีอินเทอร์เน็ต การแปลออฟไลน์ก็พร้อมให้บริการ
vi: Công nghệ giảm tiếng ồn AI lọc tiếng ồn và bắt giọng nói chính xác. Ngay cả khi không có internet.
zh: AI降噪技术过滤环境噪音，精准捕捉人声。即使没有网络，离线翻译也能为您保驾护航。

# onboarding.skip
source: Skip
ja: スキップ
my: ကျော်
th: ข้าม
vi: Bỏ qua
zh: 跳过

# paywall.title
source: Unlock All Features
ja: 全機能をアンロック
my: အင်္ဂါရပ်အားလုံးဖွင့်
th: ปลดล็อกฟีเจอร์ทั้งหมด
vi: Mở khóa tất cả tính năng
zh: 解锁全部功能

# paywall.subtitle
source: Unlimited Translation · Immersive Mode · AI Noise Reduction · Offline
ja: 無制限翻訳・イマーシブモード・AIノイズリダクション・オフライン
th: แปลไม่จำกัด · โหมดดื่มด่ำ · ลดเสียงรบกวน AI · ออฟไลน์
vi: Dịch không giới hạn · Chế độ đắm chìm · Giảm tiếng ồn AI · Ngoại tuyến
zh: 无限翻译 · 沉浸模式 · AI降噪 · 离线翻译

# paywall.feature.unlimited
source: Unlimited translation time
ja: 無制限の翻訳時間
th: เวลาแปลไม่จำกัด
vi: Thời gian dịch không giới hạn
zh: 无限翻译时长

# paywall.feature.immersive
source: Immersive Mode (airport announcements)
ja: Simultaneous Interpretation
vi: Chế độ đắm chìm (thông báo sân bay)
zh: 沉浸模式（机场广播翻译）

# paywall.feature.noise
source: AI Smart Noise Reduction
ja: AIスマートノイズリダクション
th: ลดเสียงรบกวน AI อัจฉริยะ
vi: Giảm tiếng ồn AI thông minh
zh: AI智能降噪

# paywall.feature.offline
source: Offline Translation
ja: オフライン翻訳
th: แปลออฟไลน์
vi: Dịch ngoại tuyến
zh: 离线翻译

# paywall.feature.conversation
source: Conversation Mode
ja: 会話モード
th: โหมดสนทนา
vi: Chế độ hội thoại
zh: 对话模式

# paywall.feature.bilingual
source: Bilingual Subtitles
ja: バイリンガル字幕
th: คำบรรยายสองภาษา
vi: Phụ đề song ngữ
zh: 双语字幕

# paywall.trial.start
source: Start 7-Day Free Trial
ja: 7日間無料トライアルを開始
th: เริ่มทดลองใช้ฟรี 7 วัน
vi: Dùng thử miễn phí 7 ngày
zh: 开始7天免费试用

# paywall.restore
source: Restore Purchase
ja: 購入を復元
my: ဝယ်ယူမှုပြန်လည်ရယူ
th: กู้คืนการซื้อ
vi: Khôi phục mua hàng
zh: 恢复购买

# paywall.terms
source: Terms of Use
ja: 利用規約
my: အသုံးပြုမှုစည်းကမ်း
th: เงื่อนไขการใช้งาน
vi: Điều khoản sử dụng
zh: 使用条款

# paywall.privacy
source: Privacy Policy
ja: プライバシーポリシー
my: ကိုယ်ရေးကိုယ်တာမူဝါဒ
th: นโยบายความเป็นส่วนตัว
vi: Chính sách bảo mật
zh: 隐私政策

# paywall.success.title
source: Subscription Successful!
ja: サブスクリプション成功！
th: สมัครสมาชิกสำเร็จ!
vi: Đăng ký thành công!
zh: 订阅成功！

# paywall.success.subtitle
source: All features unlocked
ja: 全機能がアンロックされました
th: ปลดล็อกฟีเจอร์ทั้งหมดแล้ว
vi: Tất cả tính năng đã được mở khóa
zh: 所有功能已解锁

# paywall.recommended
source: Recommended
ja: おすすめ
th: แนะนำ
vi: Đề xuất
zh: 推荐

# paywall.yearly
source: Year
ja: 年
th: ปี
vi: Năm
zh: 年

# paywall.monthly
source: Month
ja: 月
th: เดือน
vi: Tháng
zh: 月

# paywall.per.year
source: /year
ja: /年
th: /ปี
vi: /năm
zh: /年

# paywall.per.month
source: /month
ja: /月
th: /เดือน
vi: /tháng
zh: /月

# paywall.terms.detail
source: Subscription will be charged to your Apple ID account. It auto-renews 24 hours before expiration. You can manage and cancel subscriptions in App Store account settings.
ja: サブスクリプションはApple IDアカウントに請求されます。有効期限の24時間前に自動更新されます。App Storeのアカウント設定でサブスクリプションを管理・キャンセルできます。
th: การสมัครสมาชิกจะเรียกเก็บเงินผ่านบัญชี Apple ID ของคุณ ต่ออายุอัตโนมัติ 24 ชั่วโมงก่อนหมดอายุ คุณสามารถจัดการและยกเลิกการสมัครสมาชิกในการตั้งค่าบัญชี App Store
vi: Đăng ký sẽ được tính phí qua tài khoản Apple ID. Tự động gia hạn 24 giờ trước khi hết hạn. Bạn có thể quản lý và hủy đăng ký trong cài đặt tài khoản App Store.
zh: 订阅将通过您的Apple ID账户收费。订阅会在到期前24小时内自动续订，届时将向您的账户收取续订费用。您可以在App Store账户设置中管理和取消订阅。

# sub.free
source: Free
ja: 無料版
my: အခမဲ့
th: ฟรี
vi: Miễn phí
zh: 免费版

# sub.monthly
source: Monthly
ja: 月額プラン
my: လစဉ်
th: รายเดือน
vi: Hàng tháng
zh: 月度会员

# sub.yearly
source: Yearly
ja: 年額プラン
my: နှစ်စဉ်
th: รายปี
vi: Hàng năm
zh: 年度会员

# sub.free.desc
source: 5 minutes free translation daily
ja: 毎日5分間無料翻訳
th: แปลฟรี 5 นาทีต่อวัน
vi: Dịch miễn phí 5 phút mỗi ngày
zh: 每天5分钟免费翻译

# sub.monthly.desc
source: Unlimited translation · All features
ja: 無制限翻訳・全機能
th: แปลไม่จำกัด · ฟีเจอร์ทั้งหมด
vi: Dịch không giới hạn · Tất cả tính năng
zh: 无限翻译 · 全部功能

# sub.yearly.desc
source: Unlimited translation · All features · Save 40%
ja: 無制限翻訳・全機能・40%お得
th: แปลไม่จำกัด · ฟีเจอร์ทั้งหมด · ประหยัด 40%
vi: Dịch không giới hạn · Tất cả tính năng · Tiết kiệm 40%
zh: 无限翻译 · 全部功能 · 省40%

# sub.feature.quota
source: 5 min daily translation
ja: 1日5分の翻訳枠
th: โควต้าแปล 5 นาทีต่อวัน
vi: Hạn mức dịch 5 phút/ngày
zh: 每天5分钟翻译额度

# sub.feature.conversation
source: Conversation Mode
ja: 会話モード
th: โหมดสนทนา
vi: Chế độ hội thoại
zh: 对话模式

# sub.feature.languages
source: 30+ Languages
ja: 30以上の言語
th: 30+ ภาษา
vi: 30+ ngôn ngữ
zh: 30+种语言

# sub.feature.bilingual
source: Bilingual Subtitles
ja: バイリンガル字幕
th: คำบรรยายสองภาษา
vi: Phụ đề song ngữ
zh: 双语字幕

# sub.feature.unlimited
source: Unlimited translation time
ja: 無制限の翻訳時間
th: เวลาแปลไม่จำกัด
vi: Thời gian dịch không giới hạn
zh: 无限翻译时长

# sub.feature.allModes
source: Conversation + Immersive Mode
ja: Conversation + Interpreter
th: Conversation + Interpreter
vi: Hội thoại + Đắm chìm
zh: 对话模式 + 沉浸模式

# sub.feature.noise
source: AI Smart Noise Reduction
ja: AIスマートノイズリダクション
th: ลดเสียงรบกวน AI อัจฉริยะ
vi: Giảm tiếng ồn AI thông minh
zh: AI智能降噪

# sub.feature.offline
source: Offline Translation
ja: オフライン翻訳
th: แปลออฟไลน์
vi: Dịch ngoại tuyến
zh: 离线翻译

# sub.feature.export
source: Translation History Export
ja: 翻訳履歴エクスポート
th: ส่งออกประวัติการแปล
vi: Xuất lịch sử dịch
zh: 翻译历史导出

# sub.feature.support
source: Priority Support
ja: 優先サポート
th: สนับสนุนลูกค้าเร่งด่วน
vi: Hỗ trợ ưu tiên
zh: 优先客服支持

# sub.error.load
source: Failed to load subscription plans. Please check your network.
ja: サブスクリプションプランの読み込みに失敗しました。ネットワークを確認してください。
th: โหลดแผนสมาชิกไม่สำเร็จ กรุณาตรวจสอบเครือข่าย
vi: Không thể tải gói đăng ký. Vui lòng kiểm tra mạng.
zh: 加载订阅方案失败，请检查网络连接

# sub.error.pending
source: Purchase is being processed. Please check later.
ja: 購入処理中です。後ほどご確認ください。
th: กำลังดำเนินการซื้อ กรุณาตรวจสอบภายหลัง
vi: Đang xử lý mua hàng. Vui lòng kiểm tra sau.
zh: 购买正在处理中，请稍后查看

# error.noApiKey
source: Please configure your OpenAI API key in Settings
ja: 設定でGemini APIキーを設定してください
th: กรุณาตั้งค่า Gemini API key ในการตั้งค่า
vi: Vui lòng cấu hình API key Gemini trong Cài đặt
zh: 请先在设置中配置您的OpenAI API密钥

# error.noApiKey.short
source: API key not configured
ja: APIキー未設定
th: ยังไม่ได้ตั้งค่า API key
vi: Chưa cấu hình API key
zh: 未配置API密钥

# error.offlineUnavailable
source: Offline translation unavailable: Please check if language pack is downloaded
ja: オフライン翻訳が利用できません：言語パックがダウンロードされているか確認してください
th: แปลออฟไลน์ไม่พร้อมใช้งาน: กรุณาตรวจสอบว่าดาวน์โหลดชุดภาษาแล้ว
vi: Dịch ngoại tuyến không khả dụng: Vui lòng kiểm tra gói ngôn ngữ
zh: 离线翻译不可用：请检查设备是否已下载语言包

# error.invalidUrl
source: Invalid API URL
ja: 無効なAPI URL
th: URL API ไม่ถูกต้อง
vi: URL API không hợp lệ
zh: API地址无效

# error.connectionFailed
source: Failed to connect to translation service
ja: 翻訳サービスへの接続に失敗
th: เชื่อมต่อบริการแปลไม่สำเร็จ
vi: Không thể kết nối dịch vụ dịch
zh: 连接翻译服务失败

# error.encodingFailed
source: Data encoding failed
ja: データエンコードに失敗
th: เข้ารหัสข้อมูลไม่สำเร็จ
vi: Mã hóa dữ liệu thất bại
zh: 数据编码失败
