Repository: toby05169/Translatar
Catalog: Translatar/Resources/*.lproj/Localizable.strings
Languages: ja, my, th, vi, zh

# error.audio.format
source: Cannot create target audio format
ja: ターゲットオーディオフォーマットを作成できません
th: ไม่สามารถสร้างรูปแบบเสียงเป้าหมาย
vi: Không thể tạo định dạng âm thanh đích
zh: 无法创建目标音频格式

# error.audio.converter
source: Cannot create audio format converter
ja: オーディオフォーマットコンバーターを作成できません
th: ไม่สามารถสร้างตัวแปลงรูปแบบเสียง
vi: Không thể tạo bộ chuyển đổi định dạng âm thanh
zh: 无法创建音频格式转换器

# error.audio.engine
source: Audio engine failed to start
ja: オーディオエンジンの起動に失敗
th: เริ่มเอนจินเสียงไม่สำเร็จ
vi: Khởi động engine âm thanh thất bại
zh: 音频引擎启动失败

# offline.status.standby
source: Offline mode standby
ja: オフラインモード待機中
th: โหมดออฟไลน์พร้อม
vi: Chế độ ngoại tuyến chờ
zh: 离线模式待命

# offline.status.preparing
source: Preparing offline translation...
ja: オフライン翻訳を準備中...
th: กำลังเตรียมแปลออฟไลน์...
vi: Đang chuẩn bị dịch ngoại tuyến...
zh: 正在准备离线翻译...

# offline.status.ready
source: Offline mode ready
ja: オフラインモード準備完了
th: โหมดออฟไลน์พร้อมใช้งาน
vi: Chế độ ngoại tuyến sẵn sàng
zh: 离线模式就绪

# offline.status.listening
source: Listening (offline)...
ja: リスニング中（オフライン）...
th: กำลังฟัง (ออฟไลน์)...
vi: Đang nghe (ngoại tuyến)...
zh: 正在监听（离线）...

# offline.status.translating
source: Translating (offline)...
ja: 翻訳中（オフライン）...
th: กำลังแปล (ออฟไลน์)...
vi: Đang dịch (ngoại tuyến)...
zh: 正在翻译（离线）...

# offline.status.playing
source: Playing translation...
ja: 翻訳を再生中...
th: กำลังเล่นคำแปล...
vi: Đang phát bản dịch...
zh: 正在播放翻译...

# offline.error.permDenied
source: Speech recognition permission denied. Please enable in Settings.
ja: 音声認識の権限が拒否されました。設定で有効にしてください。
th: สิทธิ์การรู้จำเสียงถูกปฏิเสธ กรุณาเปิดในการตั้งค่า
vi: Quyền nhận dạng giọng nói bị từ chối. Vui lòng bật trong Cài đặt.
zh: 语音识别权限被拒绝，请在设置中开启

# offline.error.notSupported
source: Device does not support speech recognition
ja: デバイスは音声認識をサポートしていません
th: อุปกรณ์ไม่รองรับการรู้จำเสียง
vi: Thiết bị không hỗ trợ nhận dạng giọng nói
zh: 设备不支持语音识别

# offline.error.permUndetermined
source: Speech recognition permission not determined
ja: 音声認識の権限が未決定
th: สิทธิ์การรู้จำเสียงยังไม่ได้กำหนด
vi: Quyền nhận dạng giọng nói chưa xác định
zh: 语音识别权限未确定

# offline.error.permUnknown
source: Unknown permission status
ja: 不明な権限状態
th: สถานะสิทธิ์ไม่ทราบ
vi: Trạng thái quyền không xác định
zh: 未知权限状态

# offline.error.recognizerUnavailable
source: Speech recognizer unavailable. Please check if language pack is downloaded.
ja: 音声認識が利用できません。言語パックがダウンロードされているか確認してください。
th: ตัวรู้จำเสียงไม่พร้อมใช้งาน กรุณาตรวจสอบว่าดาวน์โหลดชุดภาษาแล้ว
vi: Bộ nhận dạng giọng nói không khả dụng. Vui lòng kiểm tra gói ngôn ngữ.
zh: 语音识别器不可用，请检查语言包是否已下载

# offline.error.cannotCreateRequest
source: Cannot create recognition request
ja: 認識リクエストを作成できません
th: ไม่สามารถสร้างคำขอรู้จำ
vi: Không thể tạo yêu cầu nhận dạng
zh: 无法创建识别请求

# paywall.trial.note.prefix
source: After trial,
ja: トライアル終了後、
my: အစမ်းသုံးပြီးနောက်
th: หลังทดลองใช้ จะเรียกเก็บ
vi: Sau khi dùng thử,
zh: 试用结束后将以

# paywall.autorenew.suffix
source: auto-renews. Cancel anytime in Settings.
ja: で自動更新されます。設定からいつでもキャンセル可能。
my: အလိုအလျောက်သက်တမ်းတိုးပါမည်။
th: ต่ออายุอัตโนมัติ ยกเลิกได้ตลอดเวลาในการตั้งค่า
vi: tự động gia hạn. Hủy bất cứ lúc nào trong Cài đặt.
zh: 自动续订。可随时在设置中取消。

# paywall.trial.prefix
source: 7-day free trial
ja: 7日間無料トライアル
my: 7 ရက်အခမဲ့အစမ်းသုံး
th: ทดลองใช้ฟรี 7 วัน
vi: Dùng thử miễn phí 7 ngày
zh: 7天免费试用

# paywall.trial.after
source: then
ja: その後
my: ထို့နောက်
th: จากนั้น
vi: sau đó
zh: 之后

# history.count
source: Total
ja: 全
th: ทั้งหมด
vi: Tổng cộng

# history.count.suffix
source: records
ja: 件の記録
th: รายการ
vi: bản ghi
